cook_book = [
    [
        "салат",
        [
            ["картофель", 100, "гр."],
            ["морковь", 50, "гр."],
            ["огурцы", 50, "гр."],
            ["горошек", 30, "гр."],
            ["майонез", 70, "мл."],
        ],
    ],
    [
        "пицца",
        [
            ["сыр", 50, "гр."],
            ["томаты", 50, "гр."],
            ["тесто", 100, "гр."],
            ["бекон", 30, "гр."],
            ["колбаса", 30, "гр."],
            ["грибы", 20, "гр."],
        ],
    ],
    [
        "фруктовый десерт",
        [
            ["хурма", 60, "гр."],
            ["киви", 60, "гр."],
            ["творог", 60, "гр."],
            ["сахар", 10, "гр."],
            ["мед", 50, "мл."],
        ],
    ],
]
person = 5

for dish in cook_book:
    print(dish[0].capitalize())
    for gros in dish[1]:
        print(f"{gros[0]}, {gros[1] * person}{gros[2]}")
# print(cook_book)

